[
  {
    "figureNum": 1,
    "filename": "figure-1.png",
    "caption": "Рис. 1. Таблица описывается отношением , которое представляется множеством строк , принадлежащих декартову произведению ."
  },
  {
    "figureNum": 2,
    "filename": "figure-2.png",
    "caption": "Рис. 2. Сравнение реляционной модели и ассоциативной модели данных (изначальная модель Саймона Вильямса была упрощена дважды). Иными словами для представления всех данных в реляционной модели требуется множество таблиц под каждый тип данных, в ассоциативной модели как оказалось было достаточно сначала двух таблиц, а потом и вовсе одной таблицы триплетов или дуплетов."
  },
  {
    "figureNum": 3,
    "filename": "figure-3.png",
    "caption": "Рис. 3. Сравнение теории графов и теории связей. Вершина эквивалентна замкнутой на себя связи, то есть связи которая в себе начинается и в себе заканчивается. Направленное ребро отображается в направленную связь-дуплет. А ненаправленное ребро отображается в пару направленных связей-дуплетов в обоих направлениях. То есть если в теории графов требуется два типа сущностей - вершины и рёбра, то в теории связей достаточно только связей (больше всего похожих на рёбра)."
  },
  {
    "figureNum": 4,
    "filename": "figure-4.png",
    "caption": "Рис. 4. Матрица представляющая декартово произведение множества { 1, 2 } на само себя. Здесь мы видим что у связей с двумя ссылками на связи может быть всего 4 возможных значения."
  },
  {
    "figureNum": 5,
    "filename": "figure-5.png",
    "caption": "Рис. 5. Таблица строк содержащих все возможные варианты значения связей для сети с двумя связями, эти варианты получаются при помощи декартова произведения { 1, 2 } на само себя."
  },
  {
    "figureNum": 6,
    "filename": "figure-6.png",
    "caption": "Рис. 6. Сеть из трёх связей. Представление сети дуплетов похожее на граф, но такую визуализацию мы называем сетью связей. 1-я и 2-я связи имеют похожую структуру. То есть обе начинаются в себе и заканчиваются в себе. Отсюда получается что вместо традиционного представления в виде точки в теории графов мы получаем графическое представление замкнутой стрелки которое похоже на нечто вроде символа бесконечности."
  },
  {
    "figureNum": 7,
    "filename": "figure-7.png",
    "caption": "Рис. 7. Это графическое представление декартова произведения в виде матрицы, которое представляет все возможные значения связей. Здесь оранжевым цветом выделены связи, которые задают конкретную сеть связей. То есть из 9 возможных вариантов значений связи выбраны всего 3 связи, что соответствует размеру множества L."
  },
  {
    "figureNum": 8,
    "filename": "figure-8.png",
    "caption": "Рис. 8. Трёхмерный куб-матрица, который представляет все возможные значения связи-триплета. Получить такой куб можно используя декартово произведение множества { 1 , 2 } на само себя, рекурсивно, то есть { 1 , 2 } × { 1 , 2 } × { 1 , 2 }."
  },
  {
    "figureNum": 9,
    "filename": "figure-9.png",
    "caption": "Рис. 9. Таблица всех возможных вариантов значения связи-триплета, которую можно получить используя декартово произведение множества { 1 , 2 } на само себя, рекурсивно, то есть { 1 , 2 } × { 1 , 2 } × { 1 , 2 }. Примечание: первая ссылка интерпретируется как начало, вторая как тип, а третья как конец; пользователь сам определяет как интерпретировать компоненты вектора ссылок в соответствии с решаемой задачей. "
  },
  {
    "figureNum": 10,
    "filename": "figure-10.jpg",
    "caption": "Рис. 10. Ассоциативная сеть триплетов представленная в виде цветного орграфа. В этой ассоциативной сети 4 триплета соответствующие функции заданной выше. Узлы соответствуют связям, а цвета ребёр соответствуют ссылкам на связи в соответствии с Рис. 9 (красный - from, синий - type, зелёный - to)."
  }
]